; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-2-16-14)
(:domain gripper-strips)
(:objects robot1 robot2 - robot
rgripper1 lgripper1 rgripper2 lgripper2 - gripper
room1 room2 room3 room4 room5 room6 room7 room8 room9 room10 room11 room12 room13 room14 room15 room16 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 - object)
(:init
(at-robby robot1 room11)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room8)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at ball1 room14)
(at ball2 room13)
(at ball3 room14)
(at ball4 room12)
(at ball5 room3)
(at ball6 room10)
(at ball7 room4)
(at ball8 room8)
(at ball9 room1)
(at ball10 room6)
(at ball11 room5)
(at ball12 room8)
(at ball13 room11)
(at ball14 room1)
)
(:goal
(and
(at ball1 room15)
(at ball2 room14)
(at ball3 room10)
(at ball4 room8)
(at ball5 room9)
(at ball6 room9)
(at ball7 room8)
(at ball8 room1)
(at ball9 room11)
(at ball10 room1)
(at ball11 room1)
(at ball12 room13)
(at ball13 room9)
(at ball14 room3)
)
)
)

; plan
1. (pick robot2 ball8 room8 lgripper2)
   deleted: (at ball8 room8) (free robot2 lgripper2)
   added: (carry robot2 ball8 lgripper2)
   goals met: 0 of 14
2. (pick robot2 ball12 room8 rgripper2)
   deleted: (at ball12 room8) (free robot2 rgripper2)
   added: (carry robot2 ball12 rgripper2)
   goals met: 0 of 14
3. (pick robot1 ball13 room11 lgripper1)
   deleted: (at ball13 room11) (free robot1 lgripper1)
   added: (carry robot1 ball13 lgripper1)
   goals met: 0 of 14
4. (move robot1 room11 room9)
   deleted: (at-robby robot1 room11)
   added: (at-robby robot1 room9)
   goals met: 0 of 14
5. (move robot2 room8 room13)
   deleted: (at-robby robot2 room8)
   added: (at-robby robot2 room13)
   goals met: 0 of 14
6. (drop robot1 ball13 room9 lgripper1)
   deleted: (carry robot1 ball13 lgripper1)
   added: (at ball13 room9) (free robot1 lgripper1)
   goals met: 1 of 14
7. (drop robot2 ball12 room13 rgripper2)
   deleted: (carry robot2 ball12 rgripper2)
   added: (at ball12 room13) (free robot2 rgripper2)
   goals met: 2 of 14
8. (move robot2 room13 room1)
   deleted: (at-robby robot2 room13)
   added: (at-robby robot2 room1)
   goals met: 2 of 14
9. (move robot1 room9 room8)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room8)
   goals met: 2 of 14
10. (drop robot2 ball8 room1 lgripper2)
   deleted: (carry robot2 ball8 lgripper2)
   added: (at ball8 room1) (free robot2 lgripper2)
   goals met: 3 of 14
11. (pick robot2 ball9 room1 rgripper2)
   deleted: (at ball9 room1) (free robot2 rgripper2)
   added: (carry robot2 ball9 rgripper2)
   goals met: 3 of 14
12. (move robot1 room8 room6)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room6)
   goals met: 3 of 14
13. (move robot2 room1 room11)
   deleted: (at-robby robot2 room1)
   added: (at-robby robot2 room11)
   goals met: 3 of 14
14. (pick robot1 ball10 room6 lgripper1)
   deleted: (at ball10 room6) (free robot1 lgripper1)
   added: (carry robot1 ball10 lgripper1)
   goals met: 3 of 14
15. (drop robot2 ball9 room11 rgripper2)
   deleted: (carry robot2 ball9 rgripper2)
   added: (at ball9 room11) (free robot2 rgripper2)
   goals met: 4 of 14
16. (move robot1 room6 room9)
   deleted: (at-robby robot1 room6)
   added: (at-robby robot1 room9)
   goals met: 4 of 14
17. (move robot2 room11 room9)
   deleted: (at-robby robot2 room11)
   added: (at-robby robot2 room9)
   goals met: 4 of 14
18. (move robot1 room9 room1)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room1)
   goals met: 4 of 14
19. (drop robot1 ball10 room1 lgripper1)
   deleted: (carry robot1 ball10 lgripper1)
   added: (at ball10 room1) (free robot1 lgripper1)
   goals met: 5 of 14
20. (pick robot1 ball14 room1 rgripper1)
   deleted: (at ball14 room1) (free robot1 rgripper1)
   added: (carry robot1 ball14 rgripper1)
   goals met: 5 of 14
21. (move robot2 room9 room5)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room5)
   goals met: 5 of 14
22. (move robot1 room1 room3)
   deleted: (at-robby robot1 room1)
   added: (at-robby robot1 room3)
   goals met: 5 of 14
23. (pick robot2 ball11 room5 lgripper2)
   deleted: (at ball11 room5) (free robot2 lgripper2)
   added: (carry robot2 ball11 lgripper2)
   goals met: 5 of 14
24. (drop robot1 ball14 room3 rgripper1)
   deleted: (carry robot1 ball14 rgripper1)
   added: (at ball14 room3) (free robot1 rgripper1)
   goals met: 6 of 14
25. (move robot2 room5 room9)
   deleted: (at-robby robot2 room5)
   added: (at-robby robot2 room9)
   goals met: 6 of 14
26. (pick robot1 ball5 room3 lgripper1)
   deleted: (at ball5 room3) (free robot1 lgripper1)
   added: (carry robot1 ball5 lgripper1)
   goals met: 6 of 14
27. (move robot1 room3 room9)
   deleted: (at-robby robot1 room3)
   added: (at-robby robot1 room9)
   goals met: 6 of 14
28. (move robot2 room9 room1)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room1)
   goals met: 6 of 14
29. (drop robot1 ball5 room9 lgripper1)
   deleted: (carry robot1 ball5 lgripper1)
   added: (at ball5 room9) (free robot1 lgripper1)
   goals met: 7 of 14
30. (drop robot2 ball11 room1 lgripper2)
   deleted: (carry robot2 ball11 lgripper2)
   added: (at ball11 room1) (free robot2 lgripper2)
   goals met: 8 of 14
31. (move robot2 room1 room9)
   deleted: (at-robby robot2 room1)
   added: (at-robby robot2 room9)
   goals met: 8 of 14
32. (move robot1 room9 room4)
   deleted: (at-robby robot1 room9)
   added: (at-robby robot1 room4)
   goals met: 8 of 14
33. (move robot2 room9 room14)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room14)
   goals met: 8 of 14
34. (pick robot1 ball7 room4 lgripper1)
   deleted: (at ball7 room4) (free robot1 lgripper1)
   added: (carry robot1 ball7 lgripper1)
   goals met: 8 of 14
35. (move robot1 room4 room8)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room8)
   goals met: 8 of 14
36. (pick robot2 ball3 room14 lgripper2)
   deleted: (at ball3 room14) (free robot2 lgripper2)
   added: (carry robot2 ball3 lgripper2)
   goals met: 8 of 14
37. (drop robot1 ball7 room8 lgripper1)
   deleted: (carry robot1 ball7 lgripper1)
   added: (at ball7 room8) (free robot1 lgripper1)
   goals met: 9 of 14
38. (move robot2 room14 room10)
   deleted: (at-robby robot2 room14)
   added: (at-robby robot2 room10)
   goals met: 9 of 14
39. (drop robot2 ball3 room10 lgripper2)
   deleted: (carry robot2 ball3 lgripper2)
   added: (at ball3 room10) (free robot2 lgripper2)
   goals met: 10 of 14
40. (pick robot2 ball6 room10 rgripper2)
   deleted: (at ball6 room10) (free robot2 rgripper2)
   added: (carry robot2 ball6 rgripper2)
   goals met: 10 of 14
41. (move robot1 room8 room14)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room14)
   goals met: 10 of 14
42. (move robot2 room10 room9)
   deleted: (at-robby robot2 room10)
   added: (at-robby robot2 room9)
   goals met: 10 of 14
43. (pick robot1 ball1 room14 lgripper1)
   deleted: (at ball1 room14) (free robot1 lgripper1)
   added: (carry robot1 ball1 lgripper1)
   goals met: 10 of 14
44. (drop robot2 ball6 room9 rgripper2)
   deleted: (carry robot2 ball6 rgripper2)
   added: (at ball6 room9) (free robot2 rgripper2)
   goals met: 11 of 14
45. (move robot1 room14 room8)
   deleted: (at-robby robot1 room14)
   added: (at-robby robot1 room8)
   goals met: 11 of 14
46. (move robot2 room9 room13)
   deleted: (at-robby robot2 room9)
   added: (at-robby robot2 room13)
   goals met: 11 of 14
47. (move robot1 room8 room15)
   deleted: (at-robby robot1 room8)
   added: (at-robby robot1 room15)
   goals met: 11 of 14
48. (pick robot2 ball2 room13 lgripper2)
   deleted: (at ball2 room13) (free robot2 lgripper2)
   added: (carry robot2 ball2 lgripper2)
   goals met: 11 of 14
49. (drop robot1 ball1 room15 lgripper1)
   deleted: (carry robot1 ball1 lgripper1)
   added: (at ball1 room15) (free robot1 lgripper1)
   goals met: 12 of 14
50. (move robot1 room15 room12)
   deleted: (at-robby robot1 room15)
   added: (at-robby robot1 room12)
   goals met: 12 of 14
51. (move robot2 room13 room14)
   deleted: (at-robby robot2 room13)
   added: (at-robby robot2 room14)
   goals met: 12 of 14
52. (drop robot2 ball2 room14 lgripper2)
   deleted: (carry robot2 ball2 lgripper2)
   added: (at ball2 room14) (free robot2 lgripper2)
   goals met: 13 of 14
53. (pick robot1 ball4 room12 lgripper1)
   deleted: (at ball4 room12) (free robot1 lgripper1)
   added: (carry robot1 ball4 lgripper1)
   goals met: 13 of 14
54. (move robot1 room12 room8)
   deleted: (at-robby robot1 room12)
   added: (at-robby robot1 room8)
   goals met: 13 of 14
55. (drop robot1 ball4 room8 lgripper1)
   deleted: (carry robot1 ball4 lgripper1)
   added: (at ball4 room8) (free robot1 lgripper1)
   goals met: 14 of 14
